# Dictionary Operations

### => Combine two dictionary

In [ ]:
'''
Ex - 01 
Write a Python program to combine two dictionary adding values for common keys. 
d1 = {'a': 100, 'b': 200, 'c':300}
d2 = {'a': 300, 'b': 200, 'd':400}
Sample output: Counter({'a': 400, 'b': 400, 'd': 400, 'c': 300})
'''

In [6]:
# Loop
d1 = {'a':100,'b':200,'c':200}
d2 = {'a':100,'b':100,'d':300}
for key in d1:
    if d2.get(key):                 # Syntax : Dict.get(key, default=None)
        print(d2[key])              # method might give error recommend use get
        d2[key] = d2[key] + d1[key]
    else:
        d2[key] = d1[key] 
        
print(d2)

100
100
{'a': 200, 'b': 300, 'd': 300, 'c': 200}

In [15]:
# dict comp
d1 = {'a':100,'b':200,'c':200}
d2 = {'a':100,'b':100,'d':300}
print({k: d1.get(k,0) + d2.get(k,0) for k in set(d1) | set(d2)})

{'a': 200, 'b': 300, 'd': 300, 'c': 200}

In [9]:
for i in set(d1) | set(d2):
    print(i)

a
b
d
c

In [24]:
{k:d1.get(k,0) for k in set(d1) | set(d2) }   # Syntax : Dict.get(key, default=None)

{'a': 100, 'b': 200, 'd': 0, 'c': 200}

In [7]:
from collections import Counter
d1 = {'a':100,'b':200,'c':200}
d2 = {'a':100,'b':100,'d':300}

d3 = dict(Counter(d1) + Counter(d2))
print(d3)

{'a': 200, 'b': 300, 'c': 200, 'd': 300}

### => Unique values

In [ ]:
'''
Write a Python program to print all unique values in a dictionary. 
Sample Data : [{"V":"S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII":"S005"},
{"V":"S009"},{"VIII":"S007"}]
Expected Output : Unique Values: {'S005', 'S002', 'S007', 'S001', 'S009'}
'''

In [8]:
l =  [{"V":"S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII":"S005"},
{"V":"S009"},{"VIII":"S007"}]

lst = set(j for i in l for j in i.values())
print(lst)

{'S007', 'S005', 'S001', 'S002', 'S009'}

In [25]:
# OR
l =  [{"V":"S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII":"S005"},
{"V":"S009"},{"VIII":"S007"}]
s = set()
for i in l:
    for j in i.values():
        s.add(j)
print(s)

{'S002', 'S007', 'S001', 'S009', 'S005'}

### => All combination

In [ ]:
'''
Write a Python program to create and display all combinations of letters, 
selecting each letter from a different key in a dictionary. 
Sample data : {'1':['a','b'], '2':['c','d']}
Expected Output:
ac
ad
bc
bd
'''

In [32]:
data = {'1':['a','b'],'2':['c','d']}

import itertools as it
sort_data = sorted(data)
print(sort_data)
com = list(it.product(*(data[i] for i in sort_data)))

for c in com:
    print("".join(c))

['1', '2']
ac
ad
bc
bd

In [40]:
# OR
x={'1':['a','b','c'], '2':['c','d','c']}
list1 = x.get('1')
list2 = x.get('2')
for i in range(len(list1)):
    for j in range(len(list2)):
        print(list1[i]+list2[j])

ac
ad
ac
bc
bd
bc
cc
cd
cc

### => Drop Empty/None Value

In [14]:
d = {'c1':'Red','c2':'Green','c3':None}
d = {k: v for k, v in d.items() if v is not None}
print(d)

{'c1': 'Red', 'c2': 'Green'}

In [45]:
# OR
d = {'c1': 'Red', 'c2': 'Green', 'c3':None}
for key, value in dict(d).items():            # dictionary changed size during iteration
    if value is None:
        del d[key]
print(d)

{'c1': 'Red', 'c2': 'Green'}

### => Filter dict values

In [ ]:
'''
Write a Python program to filter a dictionary based on values. 
Original Dictionary:
{'Cierra Vega': 175, 'Alden Cantrell': 180, 'Kierra Gentry': 165, 'Pierre Cox': 190}
Marks greater than 170:
{'Cierra Vega': 175, 'Alden Cantrell': 180, 'Pierre Cox': 190}
'''

In [16]:
d = {'Cierra Vega': 175, 'Alden Cantrell': 180, 'Kierra Gentry': 165, 'Pierre Cox': 190}
d = {k:v for k,v in d.items() if d[k] > 170}
print(d)

{'Cierra Vega': 175, 'Alden Cantrell': 180, 'Pierre Cox': 190}

# Pandas

In [ ]:
'''
Ex-01 
Write a Pandas program to join the two given 
dataframes along rows and assign all data.
student_data1:
  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
student_data2:
  student_id              name  marks
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201
'''

In [47]:
import pandas as pd
student_data1 = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
         'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'], 
        'marks': [200, 210, 190, 222, 199]})

student_data2 = pd.DataFrame({
        'student_id': ['S4', 'S5', 'S6', 'S7', 'S8'],
        'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston'], 
        'marks': [201, 200, 198, 219, 201]})

In [48]:
student_data1

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199

In [49]:
student_data2

  student_id              name  marks
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

In [50]:
df = pd.concat([student_data1,student_data2])
df

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

In [ ]:
'''write code to get dataframe of students who score more than 200 marks '''

In [51]:
df[df['marks'] > 200]

  student_id              name  marks
1         S2      Ryder Storey    210
3         S4         Ed Bernal    222
0         S4  Scarlette Fisher    201
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

In [ ]:
'''
Write a Pandas program to split the following dataframe into groups based on school code. 
Also check 
the type of GroupBy object. 

'''

In [52]:
student_data = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])

In [61]:
student_data

,school_code,class,name,date_Of_Birth,age,height,weight,address
S1,s001,V,Alberto Franco,15/05/2002,12,173,35,street1
S2,s002,V,Gino Mcneill,17/05/2002,12,192,32,street2
S3,s003,VI,Ryan Parkes,16/02/1999,13,186,33,street3
S4,s001,VI,Eesha Hinton,25/09/1998,13,167,30,street1
S5,s002,V,Gino Mcneill,11/05/2002,14,151,31,street2
S6,s004,VI,David Parkes,15/09/1997,12,159,32,street4

In [90]:
pd.set_option('display.max_rows', None)
result = student_data.groupby(['school_code'])
print(list(result))

[('s001',    school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35
S4        s001    VI    Eesha Hinton     25/09/1998   13     167      30

    address
S1  street1
S4  street1  ), ('s002',    school_code class          name date_Of_Birth   age  height  weight  \
S2        s002     V  Gino Mcneill     17/05/2002   12     192      32
S5        s002     V  Gino Mcneill     11/05/2002   14     151      31

    address
S2  street2
S5  street2  ), ('s003',    school_code class         name date_Of_Birth   age  height  weight  address
S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3), ('s004',    school_code class          name date_Of_Birth   age  height  weight  \
S6        s004    VI  David Parkes     15/09/1997   12     159      32

    address
S6  street4  )]

In [ ]:
''' Write a pandas code to get min,max,mean,median,std of all numeric columns data '''

In [91]:
student_data.describe()

             age      height     weight
count   6.000000    6.000000   6.000000
mean   12.666667  171.333333  32.166667
std     0.816497   15.680136   1.722401
min    12.000000  151.000000  30.000000
25%    12.000000  161.000000  31.250000
50%    12.500000  170.000000  32.000000
75%    13.000000  182.750000  32.750000
max    14.000000  192.000000  35.000000